Marylebone/Marylabone_run/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (10 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
       type            atmBoundaryLayerInletVelocity;
       flowDir              (1 0 0);
       zDir               (0 0 1);
       Uref            0.7287;
       Zref            557;
       z0              uniform 0.1;
       zGround         uniform 0.0;
       value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }

  //  #includeEtc "caseDicts/setConstraintTypes"

    frontAndBack
    {
      type inletOutlet;
      inletValue uniform (0 0 0);
      value uniform (0 0 0);
    }
}

// ************************************************************************* //
